In [1]:
import sqlite3
import pandas as pd

In [2]:
conn = sqlite3.connect('customer.sqlite')
cur = conn.cursor()

In [3]:
cur.execute('DROP TABLE IF EXISTS Customer_Info')
cur.execute('''CREATE TABLE Customer_Info (
CustomerID INTEGER PRIMARY KEY,
Genre TEXT,
Age INTEGER,
Annual_income INTEGER,
Spending_score INTEGER)''')
print("Table created successfully.")

Table created successfully.

In [4]:
df = pd.read_csv(r'C:\Users\Janvi\leanin\Machine learning\dataset_2.csv')
df

     CustomerID   Genre   Age  Annual_income  Spending_score
0             1    Male  19.0           15.0            39.0
1             2    Male  21.0           15.0            81.0
2             3  Female  20.0           16.0             6.0
3             4  Female  23.0           16.0            77.0
4             5  Female  31.0           17.0            40.0
..          ...     ...   ...            ...             ...
195         196  Female  35.0          120.0            79.0
196         197  Female   NaN          126.0            28.0
197         198    Male  32.0          126.0            74.0
198         199    Male  32.0          137.0             NaN
199         200    Male  30.0          137.0            83.0

[200 rows x 5 columns]

In [5]:
df.isnull().sum()

CustomerID        0
Genre             0
Age               4
Annual_income     4
Spending_score    3
dtype: int64

In [6]:
df= df.dropna() #dropping the missing values

In [7]:
df.isnull().sum()

CustomerID        0
Genre             0
Age               0
Annual_income     0
Spending_score    0
dtype: int64

In [8]:
for row in df.itertuples():
    cur.execute('''INSERT INTO Customer_Info (CustomerID,Genre,Age,Annual_income,Spending_score) VALUES(?,?,?,?,?)''', (row.CustomerID, row.Genre, row.Age, row.Annual_income,row.Spending_score,))
conn.commit()
cur.close()
print("Records inserted successfully.")

Records inserted successfully.

In [9]:
import sqlite3

In [10]:
conn = sqlite3.connect('customer.sqlite')
cur = conn.cursor()

In [11]:
cur.execute('SELECT * FROM Customer_Info')
result = cur.fetchall()
columns = ["CustomerID", "Genre", "Age", "Annual_income", "Spending_score"]
customer_df = pd.DataFrame(result, columns = columns)
customer_df

     CustomerID   Genre  Age  Annual_income  Spending_score
0             1    Male   19             15              39
1             2    Male   21             15              81
2             3  Female   20             16               6
3             4  Female   23             16              77
4             5  Female   31             17              40
..          ...     ...  ...            ...             ...
184         193    Male   33            113               8
185         195  Female   47            120              16
186         196  Female   35            120              79
187         198    Male   32            126              74
188         200    Male   30            137              83

[189 rows x 5 columns]